Documents/ЛБ_УстановкаЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановкаЦены</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ЦеныОбъектовЗалога</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерУстановкиЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Comment>Объект залога</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеСкидки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическаяЦена</Name>
							<Comment>Цена реализации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ЦеныОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ЦеныОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_УстановкаЦены/Ext/ObjectModule.bsl
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_ЦеныОбъектовЗалога.Записывать = Истина;
		
	Для каждого Стр Из ЭтотОбъект.Товары Цикл
		Если Стр.ФактическаяЦена = 0 Тогда
			Продолжить;
		КонецЕсли;	
		Движение = Движения.ЛБ_ЦеныОбъектовЗалога.Добавить();
		Движение.Период = Дата; 
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		Движение.ОбъектЗалога = Стр.ОбъектЗалога;
		Движение.Цена = стр.ФактическаяЦена; 
	Конеццикла;		
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда  
		Если НЕ УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
            ОбщегоНазначения.СообщитьПользователю("Вам запрещена отмена проведения этого документа!");
			Отказ = Истина; 
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
			
	ЗапросП = Новый Запрос;
	ЗапросП.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
	ЗапросП.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	ЗапросП.УстановитьПараметр("ОбъектыЗалога", ЭтотОбъект.Товары.ВыгрузитьКолонку("ОбъектЗалога"));
	ЗапросП.Текст = "ВЫБРАТЬ
	                |	ЛБ_УстановкаЦеныТовары.Ссылка КАК Ссылка
	                |ИЗ
	                |	Документ.ЛБ_УстановкаЦены.Товары КАК ЛБ_УстановкаЦеныТовары
	                |ГДЕ
	                |	ЛБ_УстановкаЦеныТовары.Ссылка <> &Ссылка
	                |	И ЛБ_УстановкаЦеныТовары.ОбъектЗалога В(&ОбъектыЗалога)
	                |	И ЛБ_УстановкаЦеныТовары.Ссылка.Дата >= &Дата
	                |	И ЛБ_УстановкаЦеныТовары.Ссылка.ПометкаУдаления = ЛОЖЬ";
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() тогда 
		Сообщить("Есть более поздние документы установки цены объектов залога из документа. Снятие документа с проведения запрещено.");  
		Отказ = Истина;
		Возврат;
	КонецЕсли;                                        
		
КонецПроцедуры // ОбработкаУдаленияПроведения()
